In [48]:
import pandas as pd
import numpy as np

In [49]:
df = pd.read_csv("실기 Python 실습파일 (2)/iris.csv")
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [4]:
# 특정값에 해당하는 행 정렬
df["is_setosa"]=np.where(df["Species"] == "setosa",1,0)
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species  is_setosa
0           5.1          3.5           1.4          0.2  setosa          1
1           4.9          3.0           1.4          0.2  setosa          1
2           4.7          3.2           1.3          0.2  setosa          1
3           4.6          3.1           1.5          0.2  setosa          1
4           5.0          3.6           1.4          0.2  setosa          1

In [5]:
df.tail()

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa
145,6.7,3.0,5.2,2.3,virginica,0
146,6.3,2.5,5.0,1.9,virginica,0
147,6.5,3.0,5.2,2.0,virginica,0
148,6.2,3.4,5.4,2.3,virginica,0
149,5.9,3.0,5.1,1.8,virginica,0

In [6]:
pd.crosstab(df["Species"], df["is_setosa"])

is_setosa    0   1
Species
setosa       0  50
versicolor  50   0
virginica   50   0

In [7]:
df["is_setosa_2"] = (df["Species"] == "setosa")+0 #항등원, 역원. 
df["is_setosa_3"] = (df["Species"] == "setosa")*1 # True, False값 이용.
df.head(150)

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_2,is_setosa_3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1
2,4.7,3.2,1.3,0.2,setosa,1,1,1
3,4.6,3.1,1.5,0.2,setosa,1,1,1
4,5.0,3.6,1.4,0.2,setosa,1,1,1
...,...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,0,0,0
146,6.3,2.5,5.0,1.9,virginica,0,0,0
147,6.5,3.0,5.2,2.0,virginica,0,0,0
148,6.2,3.4,5.4,2.3,virginica,0,0,0
149,5.9,3.0,5.1,1.8,virginica,0,0,0

# 변수명 바꾸기

In [8]:
# rename이 안됨
df.rename({"Sepal.Length": "SL"})

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_2,is_setosa_3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1
2,4.7,3.2,1.3,0.2,setosa,1,1,1
3,4.6,3.1,1.5,0.2,setosa,1,1,1
4,5.0,3.6,1.4,0.2,setosa,1,1,1
...,...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,0,0,0
146,6.3,2.5,5.0,1.9,virginica,0,0,0
147,6.5,3.0,5.2,2.0,virginica,0,0,0
148,6.2,3.4,5.4,2.3,virginica,0,0,0
149,5.9,3.0,5.1,1.8,virginica,0,0,0

In [9]:
#columns를 써줘야
df.rename(columns = {"Sepal.Length": "SL"})

,SL,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_2,is_setosa_3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1
2,4.7,3.2,1.3,0.2,setosa,1,1,1
3,4.6,3.1,1.5,0.2,setosa,1,1,1
4,5.0,3.6,1.4,0.2,setosa,1,1,1
...,...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,0,0,0
146,6.3,2.5,5.0,1.9,virginica,0,0,0
147,6.5,3.0,5.2,2.0,virginica,0,0,0
148,6.2,3.4,5.4,2.3,virginica,0,0,0
149,5.9,3.0,5.1,1.8,virginica,0,0,0

In [10]:
# df는 안바뀌어 있음 -> 덮어써야 
df.head()

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_2,is_setosa_3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1
2,4.7,3.2,1.3,0.2,setosa,1,1,1
3,4.6,3.1,1.5,0.2,setosa,1,1,1
4,5.0,3.6,1.4,0.2,setosa,1,1,1

In [12]:
df = df.rename(columns = {"Sepal.Length": "SL"})
df.head(2)

,SL,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_2,is_setosa_3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1

In [13]:
bike = pd.read_csv("실기 Python 실습파일 (2)/bike.csv")
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [15]:
bike.columns

Index(['datetime', 'season', 'holiday', 'workingday', 'weather', 'temp',
       'atemp', 'humidity', 'windspeed', 'casual', 'registered', 'count'],
      dtype='object')

# 판다스 특정값 뽑기(loc,iloc)

In [17]:
bike_sub = bike.iloc[:4,9:11]
bike_sub

   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10

In [22]:
bike_sub = bike.iloc[:4,9:11] #row 4개
print(len(bike_sub))
bike_sub = bike.loc[:4,["casual","registered"]]
bike_sub = bike.loc[:4,"casual":"registered"] #row 5개
print(len(bike_sub))

4
5

# 판다스 함수 적용

In [21]:
bike_sub

   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10
4       0           1

In [23]:
bike_sub.sum()

casual        19
registered    83
dtype: int64

In [24]:
bike_sub.sum(axis=1)

0    16
1    40
2    32
3    13
4     1
dtype: int64

In [25]:
bike_sub.apply(func=sum)

casual        19
registered    83
dtype: int64

In [26]:
bike_sub.apply(func=sum,axis=1)

0    16
1    40
2    32
3    13
4     1
dtype: int64

In [27]:
#bike_sub.mean()
bike_sub.apply(func=pd.Series.mean)

casual         3.8
registered    16.6
dtype: float64

In [29]:
#bike_sub.apply(func=lambda x: x.mean().round()) -> 오류 
bike_sub.apply(func=lambda x: round(x.mean()))

casual         4
registered    17
dtype: int64

# 타입 변환

In [30]:
bike_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   casual      5 non-null      int64
 1   registered  5 non-null      int64
dtypes: int64(2)
memory usage: 208.0 bytes

In [31]:
bike_sub["casual"]

0    3
1    8
2    5
3    3
4    0
Name: casual, dtype: int64

In [ ]:
# 3 + "대" -> 오류
# "3"+"대" -> 3대 : 문자끼리 합해야

In [32]:
bike_sub["casual"].astype("str") #object는 문자라고 생각해도 된다.

0    3
1    8
2    5
3    3
4    0
Name: casual, dtype: object

In [33]:
bike_sub["casual"].astype("str") + "대"

0    3대
1    8대
2    5대
3    3대
4    0대
Name: casual, dtype: object

In [34]:
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

# 날짜, 시간 다루기

In [35]:
bike["datetime"][:3]

0    2011-01-01 00:00:00
1    2011-01-01 01:00:00
2    2011-01-01 02:00:00
Name: datetime, dtype: object

In [36]:
#연정보
bike["datetime"][:3].str.slice(0,4)

0    2011
1    2011
2    2011
Name: datetime, dtype: object

In [37]:
bike["datetime"][:3].str.slice(5,2)

0
1
2
Name: datetime, dtype: object

In [38]:
#월정보
bike["datetime"][:3].str.slice(5,7)

0    01
1    01
2    01
Name: datetime, dtype: object

In [40]:
#to_datetime()매소드를 쓰면 편하다(데이터 타입이 바뀌고 시간 메소드를 쓸 수 있다.)
bike_time = pd.to_datetime(bike["datetime"][:3])
bike_time

0   2011-01-01 00:00:00
1   2011-01-01 01:00:00
2   2011-01-01 02:00:00
Name: datetime, dtype: datetime64[ns]

In [41]:
bike_time.dt.year

0    2011
1    2011
2    2011
Name: datetime, dtype: int64

In [42]:
print(bike_time.dt.year)
print(bike_time.dt.month)
print(bike_time.dt.hour)
print(bike_time.dt.weekday)

0    2011
1    2011
2    2011
Name: datetime, dtype: int64
0    1
1    1
2    1
Name: datetime, dtype: int64
0    0
1    1
2    2
Name: datetime, dtype: int64
0    5
1    5
2    5
Name: datetime, dtype: int64

# 판다스 원핫인코딩

In [43]:
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [45]:
bike_dum = pd.get_dummies(data = bike,columns = ["season"])
bike_dum.head(2)

,datetime,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,season_1,season_2,season_3,season_4
0,2011-01-01 00:00:00,0,0,1,9.84,14.395,81,0.0,3,13,16,1,0,0,0
1,2011-01-01 01:00:00,0,0,1,9.02,13.635,80,0.0,8,32,40,1,0,0,0

In [46]:
bike_dum = pd.get_dummies(data = bike,columns = ["season"]
                         drop_first = True)
bike_dum.head(2)

SyntaxError: invalid syntax (Temp/ipykernel_11408/1893440461.py, line 2)

Q1. temp변수와 atemp변수 차이의 절대값 평균은?

In [62]:
bike = pd.read_csv("실기 Python 실습파일 (2)/bike.csv")
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [59]:
bike["diff"] = bike["temp"]-bike['atemp']
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,diff
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,-4.555
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,-4.615

In [60]:
bike["diff"].abs().mean()

3.5091985118501188

Q2. casual 값의 최대값이 25가 넘은 날은 총 며칠인가?

In [65]:
bike = pd.read_csv("실기 Python 실습파일 (2)/bike.csv")
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [82]:
bike["datetime"]=pd.to_datetime(bike["datetime"])
bike["datetime"].head(2)

0   2011-01-01 00:00:00
1   2011-01-01 01:00:00
Name: datetime, dtype: datetime64[ns]

In [68]:
bike["date"] = bike["datetime"].dt.date
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,date
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,2011-01-01
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,2011-01-01

In [69]:
bike_agg = bike.groupby("date")["casual"].max()
bike_agg.head()

date
2011-01-01    47
2011-01-02    20
2011-01-03    14
2011-01-04    18
2011-01-05    12
Name: casual, dtype: int64

In [72]:
bike_agg
type(bike_agg)

pandas.core.series.Series

In [70]:
bike_agg_up25 = bike_agg[bike_agg > 25]
bike_agg_up25.head(2)

date
2011-01-01    47
2011-01-15    33
Name: casual, dtype: int64

In [73]:
len(bike_agg_up25)

384

In [76]:
bike_agg = bike.groupby("date")["casual"].max().reset_index()
bike_agg.head()

         date  casual
0  2011-01-01      47
1  2011-01-02      20
2  2011-01-03      14
3  2011-01-04      18
4  2011-01-05      12

Q3.시간대별 registered 평균을 산출했을 때 값이 가장 큰 시간은?

In [94]:
bike = pd.read_csv("실기 Python 실습파일 (2)/bike.csv")
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [95]:
bike.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10886 entries, 0 to 10885
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   datetime    10886 non-null  object
 1   season      10886 non-null  int64
 2   holiday     10886 non-null  int64
 3   workingday  10886 non-null  int64
 4   weather     10886 non-null  int64
 5   temp        10886 non-null  float64
 6   atemp       10886 non-null  float64
 7   humidity    10886 non-null  int64
 8   windspeed   10886 non-null  float64
 9   casual      10886 non-null  int64
 10  registered  10886 non-null  int64
 11  count       10886 non-null  int64
dtypes: float64(3), int64(8), object(1)
memory usage: 1020.7+ KB

In [96]:
bike["datetime"]=pd.to_datetime(bike["datetime"])
bike["datetime"].head(2)

0   2011-01-01 00:00:00
1   2011-01-01 01:00:00
Name: datetime, dtype: datetime64[ns]

In [97]:
bike["hour"] = bike["datetime"].dt.hour
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,hour
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,0
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,1

In [98]:
bike_hour = bike.groupby("hour")["registered"].max().reset_index()
bike_hour.head()

   hour  registered
0     0         234
1     1         139
2     2         103
3     3          54
4     4          22

In [99]:
bike_hour.loc[bike_hour["registered"] == bike_hour["registered"].max(),]

    hour  registered
18    18         886

In [100]:
bike_hour.loc[bike_hour["registered"].idxmax(),]

hour           18
registered    886
Name: 18, dtype: int64